import pytest
from function import combining_files

@pytest.fixture
def set_test_data():
    data = (
            {'Власова Алина': ['5.0'], 'Иванов Алексей': ['5.0'],
             'Калинина Ольга': ['5.0'], 'Лебедева Виктория': ['5.0'],
             'Миронова Вероника': ['5.0'], 'Орлова Дарья': ['5.0'],
             'Семенова Елена': ['5.0'], 'Смирнов Дмитрий': ['5.0'],
             'Степанов Игорь': ['5.0'], 'Яковлев Илья': ['5.0'],
             'Белов Станислав': ['4.5'], 'Григорьева Софья': ['4.0'],
             'Жуков Александр': ['4.0'], 'Захарова Дарья': ['4.0'],
             'Игнатьев Роман': ['4.0'], 'Максимов Кирилл': ['4.0'],
             'Морозова Екатерина': ['4.0'], 'Новиков Артем': ['4.0'],
             'Петрова Мария': ['4.0'], 'Савельева Анастасия': ['4.0'],
             'Соколов Павел': ['4.0'], 'Титов Владислав': ['4.0'],
             'Чернова Виталина': ['4.0'], 'Гусев Артур': ['3.0'],
             'Дорофеев Никита': ['3.0'], 'Крылов Антон': ['3.0'],
             'Кудрявцев Глеб': ['3.0'], 'Кузнецова Анна': ['3.0'],
             'Федоров Максим': ['3.0'], 'Фомина Ксения': ['3.0']
            },
            ['student_name', 'grade']
        )
    return data


@pytest.fixture
def set_output_data():
    data = (
            '+----+---------------------+---------+\n'\
            '|    | student_name        |   grade |\n'\
            '|----+---------------------+---------|\n'\
            '|  1 | Власова Алина       |     5   |\n'\
            '|  2 | Иванов Алексей      |     5   |\n'\
            '|  3 | Калинина Ольга      |     5   |\n'\
            '|  4 | Лебедева Виктория   |     5   |\n'\
            '|  5 | Миронова Вероника   |     5   |\n'\
            '|  6 | Орлова Дарья        |     5   |\n'\
            '|  7 | Семенова Елена      |     5   |\n'\
            '|  8 | Смирнов Дмитрий     |     5   |\n'\
            '|  9 | Степанов Игорь      |     5   |\n'\
            '| 10 | Яковлев Илья        |     5   |\n'\
            '| 11 | Белов Станислав     |     4.5 |\n'\
            '| 12 | Григорьева Софья    |     4   |\n'\
            '| 13 | Жуков Александр     |     4   |\n'\
            '| 14 | Захарова Дарья      |     4   |\n'\
            '| 15 | Игнатьев Роман      |     4   |\n'\
            '| 16 | Максимов Кирилл     |     4   |\n'\
            '| 17 | Морозова Екатерина  |     4   |\n'\
            '| 18 | Новиков Артем       |     4   |\n'\
            '| 19 | Петрова Мария       |     4   |\n'\
            '| 20 | Савельева Анастасия |     4   |\n'\
            '| 21 | Соколов Павел       |     4   |\n'\
            '| 22 | Титов Владислав     |     4   |\n'\
            '| 23 | Чернова Виталина    |     4   |\n'\
            '| 24 | Гусев Артур         |     3   |\n'\
            '| 25 | Дорофеев Никита     |     3   |\n'\
            '| 26 | Крылов Антон        |     3   |\n'\
            '| 27 | Кудрявцев Глеб      |     3   |\n'\
            '| 28 | Кузнецова Анна      |     3   |\n'\
            '| 29 | Федоров Максим      |     3   |\n'\
            '| 30 | Фомина Ксения       |     3   |\n'\
            '+----+---------------------+---------+\n'
        )
    return data


@pytest.fixture
def set_pathfile():
    test_output_file = './test_task_0/tests/test_data_out.csv'
    comparison_file = './test_task_0/tests/test_out.csv'
    return (test_output_file, comparison_file)
